dinosaure.org
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://dinosaure.github.io/org/org.css" />

* DONE extraire rabin d'ocaml-git et en faire une librairie (duff)
  CLOSED: [2018-04-06 ven. 14:32]
* DONE Faire un README.md de duff
  CLOSED: [2018-04-09 lun. 16:52]
* TODO Faire une release de duff
* DONE Implémenter un fuzzer pour duff
  CLOSED: [2018-04-06 ven. 15:56]
* DONE Faire un binaire de duff
  CLOSED: [2018-04-13 ven. 17:50]

Le fuzzer est lancer sur 163.172.129.132.

* DONE faire le README.md de radis
  CLOSED: [2018-04-06 ven. 14:28]
** Corriger les fautes en anglais
* TODO Faire une release de radis

Il s'agit de regarder surtout le licence et il semble qu'elle soit soumis à la
LGPL 2.1.

* DONE Implémenter la fonction ~remove~
  CLOSED: [2018-04-06 ven. 15:06]

Son implémentation est faite avec un trick sur les exceptions. Bon, il faut
savoir que Radis n'a pas été fait pour enlever des éléments. La solution est
donc de lever une exception ~Empty~ quand on trouve `L (k, v) when k = key` et
sur les noeuds, on rattrape cet exception pour affiner l'arbre:
- B (l, r, _, _) -> l ou r (en fonction de la direction)
- T (m, k, v)    -> L (k, v)

C'est pas propre mais bon, il y a le ~remove~.

* DONE extraire RFC1951 de decompress
  CLOSED: [2018-04-13 ven. 03:22]
** TODO [ ] contraindre decompress d'utiliser ~camlzip.1.07~

Une relecture de decompress m'amène à faire:
- une factorisation du code comme j'ai fait dans le PACK décodeur. En effet,
  ~get_bits~, ~get_byte~, etc. sont implémentés plusieurs fois dans le code. Il
  s'agit de rajouter un argument ~ctor~ pour savoir sur quelle ADT utiliser.
- Dans ~Dictionary.inflate.get~, on vérifie ~t.bits~ pour ensuite exécuter
  ~peek_bits~ qui fait la même vérification. C'est une duplication des
  vérifications que je viens de supprimer (l'impact sur les performances devrait
  être marginal cependant).
- ~Dictionary.inflate~ pose un gros problème. En effet, lorsqu'il s'agit de
  répéter l'opération ~loop~ après avoir lu quelques bits avec ~get~, la valeur
  n'est pas repris correctement par le ~k~ avec ses arguments. C'est hyper
  bizarre.

  Bon en réalité c'était des noms de variables qui correspondaient pas à ce
  qu'ils faisaient mais l'ordre était toujours bon. Genre:
  - `get (fun src dst t -> loop src dst t)` // partial application
  - `get (fun v src dst t -> loop v src dst t)`
- Je viens de me rendre compte la ~window~ peut être accessible à partir de ~t~
  au lieu de le passer aux fonctions. Cela peut être une optimisation car, dans
  certains cas, on n'alloue pas des closures.

La PR est disponible [[https://github.com/mirage/decompress/pull/41][ici]]. Le diff est pas trop lisible cependant.

L'extraction est fini, j'en ai profité pour review un petit peu le code. On a
cependant une question:

Pouvons nous utiliser l'/overload/ de l'opérateur ~.%{}~ (et restreindre les
versions d'OCaml où Decompress compile ou utiliser directement
~Array.unsafe_set~ et ~Array.unsafe_get~. C'est plus une question sur la
lisibilité du code (et rien n'est prouvé au niveau des performances) qu'autre
chose. Bref, il faut regarder cela plus précisement.

* TODO fixer Decompress.Inflate avec un random input

Bon, il semble que le problème essentiel soit que Decompress n'est toujours pas
invalidé le contenu et attends un peu plus entant qu'/input/. Le comportement est disponible avec:

#+BEGIN_SRC sh
$ echo -n "a" > input
$ ./dpipe < input > /dev/null
^C
#+END_SRC

Dans ce contexte, puisque Decompress ne vérifie pas le /header/ (TODO), il
attends quelque chose. Cependant, le /refiller/ retourne ~0~ et le considère pas
comme étant la fin du fichier - notamment parce que dans un /stream/ depuis une
/socket/, ce n'est pas le cas.

Donc le problème concerne plus de comment coder le ~refiller~ que Decompress.
Bonne nouvelle.

Cependant, il y a tout de même une /infinite loop/ bien après avec un contenu
/random/. Donc Decompress est bien trop permissif pour l'instant ce qui n'est
pas le cas de ~zlib~, on est bien face à un bug.

