dinosaure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-04-16 lun. 04:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Calascibetta" />
<link rel="stylesheet" type="text/css" href="https://dinosaure.github.io/org/org.css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge38f4a5">1. <span class="done DONE">DONE</span> extraire rabin d'ocaml-git et en faire une librairie (duff)</a></li>
<li><a href="#org562166a">2. <span class="done DONE">DONE</span> Faire un README.md de duff</a></li>
<li><a href="#org2110535">3. <span class="todo TODO">TODO</span> Faire une release de duff</a></li>
<li><a href="#org305f0b7">4. <span class="done DONE">DONE</span> Implémenter un fuzzer pour duff</a></li>
<li><a href="#orgf469335">5. <span class="done DONE">DONE</span> Faire un binaire de duff</a></li>
<li><a href="#orgf010db5">6. <span class="done DONE">DONE</span> faire le README.md de radis</a>
<ul>
<li><a href="#orge85ce22">6.1. Corriger les fautes en anglais</a></li>
</ul>
</li>
<li><a href="#org1d586a3">7. <span class="todo TODO">TODO</span> Faire une release de radis</a></li>
<li><a href="#org4206bee">8. <span class="done DONE">DONE</span> Implémenter la fonction <code>remove</code></a></li>
<li><a href="#org0818b4d">9. <span class="done DONE">DONE</span> extraire RFC1951 de decompress</a>
<ul>
<li><a href="#orgbb5da6d">9.1. <span class="todo TODO">TODO</span> [ ] contraindre decompress d'utiliser <code>camlzip.1.07</code></a></li>
</ul>
</li>
<li><a href="#org398ed04">10. <span class="todo TODO">TODO</span> fixer Decompress.Inflate avec un random input</a></li>
<li><a href="#orgd6b1cd0">11. <span class="done DONE">DONE</span> Vérifier RFC1951 sur les derniers bytes</a></li>
<li><a href="#orgc094b76">12. Fuzzer encore</a>
<ul>
<li><a href="#org2861b87">12.1. Il faut attendre la PR de Gabriel pour faire ce travail.</a></li>
</ul>
</li>
<li><a href="#org05adb40">13. <span class="todo TODO">TODO</span> Optimiser ocaml-git</a></li>
<li><a href="#orgea0e86c">14. <span class="todo TODO">TODO</span> Trouver pourquoi on avait pas trouver le bug par rapport aux \000 dans les noms dans les trees</a></li>
<li><a href="#org0c42b4a">15. <span class="todo TODO">TODO</span> Faire le serveur</a>
<ul>
<li><a href="#org1ed12af">15.1. [ ] Fuzzer l'encoder et le décoder Smart</a></li>
<li><a href="#org9fd854e">15.2. [ ] Faire le moteur de négociation</a></li>
<li><a href="#orgc968942">15.3. [ ] Faire une abstraction du serveur (TCP pour l'instant)</a></li>
</ul>
</li>
<li><a href="#org4a6b323">16. Implémenter un <i>call-by-need</i> dans ocaml-git</a></li>
<li><a href="#orgc815e04">17. <span class="todo TODO">TODO</span> Regarder mirage-lambda et y participer</a></li>
<li><a href="#orgbcceb0c">18. Passer Mr. MIME à Angstrom</a></li>
<li><a href="#org18fe732">19. Gérer l'<i>encoding</i> des e-mails (normaliser un <i>encoding</i> vers de l'UTF-8)</a>
<ul>
<li><a href="#orgf6ce0e7">19.1. Faire un outil d'importation des tables de mappings entre <i>charset</i> et unicode</a>
<ul>
<li><a href="#org6f689c1">19.1.1. [ ] outil d'importation des tables ISO8859</a></li>
<li><a href="#org4c22878">19.1.2. [ ] outil d'importation des tables VENDORS</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8c1fe52">20. <span class="todo TODO">TODO</span> Ce forcer à utiliser org-mode (2 mois de tests)</a></li>
<li><a href="#org7c7f860">21. <span class="todo TODO">TODO</span> Avoir deux serveur uDNS (un sur intel et un sur arm) et configurer son PC sur ces serveur</a></li>
<li><a href="#org86ef9cc">22. Implémenter Lwt<sub>sequence</sub> avec CFML ou Why3 pour ocaml-tcpip</a></li>
<li><a href="#org18853c3">23. <span class="todo TODO">TODO</span> Exporter les parsers d'Emile</a></li>
<li><a href="#org7150d49">24. <span class="todo TODO">TODO</span> Meilleur documentation pour Emile</a></li>
<li><a href="#org0f39b85">25. <span class="todo TODO">TODO</span> Faire une issue sur bigstringaf pour connaitre et déblayer la situation avec <code>Cstruct</code> spécifiquement</a>
<ul>
<li><a href="#org68bb9db">25.1. Implémentation C (utilisant <code>memcpy</code> et/ou <code>memmove</code>).</a></li>
<li><a href="#org1ed6dc2">25.2. Implémentation en OCaml</a></li>
<li><a href="#orga489ee1">25.3. Bound-check</a></li>
<li><a href="#org20c5d77">25.4. Disgression</a></li>
<li><a href="#org77c24e0">25.5. Conclusion</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge38f4a5" class="outline-2">
<h2 id="orge38f4a5"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> extraire rabin d'ocaml-git et en faire une librairie (duff)</h2>
<div class="outline-text-2" id="text-1">
</div>
</div>
<div id="outline-container-org562166a" class="outline-2">
<h2 id="org562166a"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Faire un README.md de duff</h2>
<div class="outline-text-2" id="text-2">
</div>
</div>
<div id="outline-container-org2110535" class="outline-2">
<h2 id="org2110535"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Faire une release de duff</h2>
</div>
<div id="outline-container-org305f0b7" class="outline-2">
<h2 id="org305f0b7"><span class="section-number-2">4</span> <span class="done DONE">DONE</span> Implémenter un fuzzer pour duff</h2>
<div class="outline-text-2" id="text-4">
</div>
</div>
<div id="outline-container-orgf469335" class="outline-2">
<h2 id="orgf469335"><span class="section-number-2">5</span> <span class="done DONE">DONE</span> Faire un binaire de duff</h2>
<div class="outline-text-2" id="text-5">
<p>
Le fuzzer est lancer sur 163.172.129.132.
</p>
</div>
</div>

<div id="outline-container-orgf010db5" class="outline-2">
<h2 id="orgf010db5"><span class="section-number-2">6</span> <span class="done DONE">DONE</span> faire le README.md de radis</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orge85ce22" class="outline-3">
<h3 id="orge85ce22"><span class="section-number-3">6.1</span> Corriger les fautes en anglais</h3>
</div>
</div>
<div id="outline-container-org1d586a3" class="outline-2">
<h2 id="org1d586a3"><span class="section-number-2">7</span> <span class="todo TODO">TODO</span> Faire une release de radis</h2>
<div class="outline-text-2" id="text-7">
<p>
Il s'agit de regarder surtout le licence et il semble qu'elle soit soumis à la
LGPL 2.1.
</p>
</div>
</div>

<div id="outline-container-org4206bee" class="outline-2">
<h2 id="org4206bee"><span class="section-number-2">8</span> <span class="done DONE">DONE</span> Implémenter la fonction <code>remove</code></h2>
<div class="outline-text-2" id="text-8">
<p>
Son implémentation est faite avec un trick sur les exceptions. Bon, il faut
savoir que Radis n'a pas été fait pour enlever des éléments. La solution est
donc de lever une exception <code>Empty</code> quand on trouve `L (k, v) when k = key` et
sur les noeuds, on rattrape cet exception pour affiner l'arbre:
</p>
<ul class="org-ul">
<li>B (l, r, _, _) -&gt; l ou r (en fonction de la direction)</li>
<li>T (m, k, v)    -&gt; L (k, v)</li>
</ul>

<p>
C'est pas propre mais bon, il y a le <code>remove</code>.
</p>
</div>
</div>

<div id="outline-container-org0818b4d" class="outline-2">
<h2 id="org0818b4d"><span class="section-number-2">9</span> <span class="done DONE">DONE</span> extraire RFC1951 de decompress</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgbb5da6d" class="outline-3">
<h3 id="orgbb5da6d"><span class="section-number-3">9.1</span> <span class="todo TODO">TODO</span> [ ] contraindre decompress d'utiliser <code>camlzip.1.07</code></h3>
<div class="outline-text-3" id="text-9-1">
<p>
Une relecture de decompress m'amène à faire:
</p>
<ul class="org-ul">
<li>une factorisation du code comme j'ai fait dans le PACK décodeur. En effet,
<code>get_bits</code>, <code>get_byte</code>, etc. sont implémentés plusieurs fois dans le code. Il
s'agit de rajouter un argument <code>ctor</code> pour savoir sur quelle ADT utiliser.</li>
<li>Dans <code>Dictionary.inflate.get</code>, on vérifie <code>t.bits</code> pour ensuite exécuter
<code>peek_bits</code> qui fait la même vérification. C'est une duplication des
vérifications que je viens de supprimer (l'impact sur les performances devrait
être marginal cependant).</li>
<li><p>
<code>Dictionary.inflate</code> pose un gros problème. En effet, lorsqu'il s'agit de
répéter l'opération <code>loop</code> après avoir lu quelques bits avec <code>get</code>, la valeur
n'est pas repris correctement par le <code>k</code> avec ses arguments. C'est hyper
bizarre.
</p>

<p>
Bon en réalité c'était des noms de variables qui correspondaient pas à ce
qu'ils faisaient mais l'ordre était toujours bon. Genre:
</p>
<ul class="org-ul">
<li>`get (fun src dst t -&gt; loop src dst t)` // partial application</li>
<li>`get (fun v src dst t -&gt; loop v src dst t)`</li>
</ul></li>
<li>Je viens de me rendre compte la <code>window</code> peut être accessible à partir de <code>t</code>
au lieu de le passer aux fonctions. Cela peut être une optimisation car, dans
certains cas, on n'alloue pas des closures.</li>
</ul>

<p>
La PR est disponible <a href="https://github.com/mirage/decompress/pull/41">ici</a>. Le diff est pas trop lisible cependant.
</p>

<p>
L'extraction est fini, j'en ai profité pour review un petit peu le code. On a
cependant une question:
</p>

<p>
Pouvons nous utiliser l'<i>overload</i> de l'opérateur <code>.%{}</code> (et restreindre les
versions d'OCaml où Decompress compile ou utiliser directement
<code>Array.unsafe_set</code> et <code>Array.unsafe_get</code>. C'est plus une question sur la
lisibilité du code (et rien n'est prouvé au niveau des performances) qu'autre
chose. Bref, il faut regarder cela plus précisement.
</p>
</div>
</div>
</div>

<div id="outline-container-org398ed04" class="outline-2">
<h2 id="org398ed04"><span class="section-number-2">10</span> <span class="todo TODO">TODO</span> fixer Decompress.Inflate avec un random input</h2>
<div class="outline-text-2" id="text-10">
<p>
Bon, il semble que le problème essentiel soit que Decompress n'est toujours pas
invalidé le contenu et attends un peu plus entant qu'<i>input</i>. Le comportement est disponible avec:
</p>

<div class="org-src-container">
<pre class="src src-sh">$ echo -n <span class="org-string">"a"</span> &gt; input
$ ./dpipe &lt; input &gt; /dev/null
^C
</pre>
</div>

<p>
Dans ce contexte, puisque Decompress ne vérifie pas le <i>header</i> (TODO), il
attends quelque chose. Cependant, le <i>refiller</i> retourne <code>0</code> et le considère pas
comme étant la fin du fichier - notamment parce que dans un <i>stream</i> depuis une
<i>socket</i>, ce n'est pas le cas.
</p>

<p>
Donc le problème concerne plus de comment coder le <code>refiller</code> que Decompress.
Bonne nouvelle.
</p>

<p>
Cependant, il y a tout de même une <i>infinite loop</i> bien après avec un contenu
<i>random</i>. Donc Decompress est bien trop permissif pour l'instant ce qui n'est
pas le cas de <code>zlib</code>, on est bien face à un bug.
</p>
</div>
</div>
