dinosaure.org
* DONE Vérifier RFC1951 sur les derniers bytes
  CLOSED: [2018-04-14 sam. 20:31]

En effet, puisque RFC1951 n'est pas forcément aligné, il nous faut vérifier
proprement si on a bien écrit les derniers bytes nécessaires qui devrait se
retrouver dans ~hold~ (et signaler à l'utilisateur combien de bits sont libres).

* Fuzzer encore
** Il faut attendre la [[https://github.com/stedolan/crowbar/pull/36][PR de Gabriel]] pour faire ce travail.

* TODO Optimiser ocaml-git
* TODO Trouver pourquoi on avait pas trouver le bug par rapport aux \000 dans les noms dans les trees
* TODO Faire le serveur
** [ ] Fuzzer l'encoder et le décoder Smart
** [ ] Faire le moteur de négociation
** [ ] Faire une abstraction du serveur (TCP pour l'instant)
* Implémenter un /call-by-need/ dans ocaml-git

L'idée est de ne pas obtenir l'objet Git dès qu'on souhaite juste le manipuler
(~Value.t~) mais de l'obtenir seulement quand on souhaite accéder à une
information à l'intérieur (comme ~Value.Commit.tree~).

On peut imaginer cette définition:

#+BEGIN_SRC ocaml
type lazy =
  | Pack of { hash : Hash.t; offset : int64 } (* identifiant du PACK et son offset dans le dit-PACK *)
  | Loose
and t =
  | Loaded of [ `Commit of Commit.t | ... ]
  | Unloaded of lazy
#+END_SRC

Bon après, je sais pas (et je pense pas) que cela soit vraiment efficace. On est
déjà dans une politique /call-by-need/ dans le sens où on charge les objets
seulement quand on les demande explicitement.

Ici, il s'agit d'affiner un peu plus le /call-by-need/ et de faire les
opérations nécessaires seulement quand on souhaite non seulement obtenir l'objet
mais aussi obtenir les informations qu'il contient - maintenant est ce que ce
n'est pas déjà le cas ?

Le retour de Thomas: Il voudrait raffiner le parser en collectant les
informations non pas d'un block comme c'est le cas mais petit à petit. On
pourrait s'en sortir avec ~Angstrom~ en splittant le parser en plusieurs
morceaux et en modifiant l'interface ~Commit.D~ pour notifier dès qu'on a
décoder le ~tree~ (puisque c'est spécifiquement celui ci qui nous intéresse) et
garder l'état du parser pour le faire continuer si l'utilisateur demande plus
d'informations.

Il est vrai que dans le format du commit, le ~tree~ est la première information
et on a ensuite les parents - qui sont toutes les deux des informations
relatives au parcours du DAG. Donc on peut imaginer que cela puisse être
intéressant - on évite notamment de décompresser au meilleur des cas les autres
valeurs et le message.

Bref, il faudrait s'intéresser à la question mais elle serait spécifique en
réalité au ~Commit~, répercuter le code sur les ~Blob~ n'a pas de sens par
exemple.

* TODO Regarder mirage-lambda et y participer

* Passer Mr. MIME à Angstrom

J'ai eu une idée de GADT.

#+BEGIN_SRC ocaml
type 'a field
  | Content_type : content_type field
  | Msg_id : msg_id field

type res =
  [ `Await of decoder
  | `Header of ('v field, 'v)
  | `End ]
#+END_SRC

En gros, le décodeur va s'arrêter à chaque /fields/ de l'e-mail et donner sa
valeur. Ce sera super bien typé grâce au GADT ~field~. Il suffira d'une fonction
~continue~ pour passer au ~field~ suivant ou au ~body~. Cependant, la question
du ~body~ (entre ~multipart/alternate~ ou simple ~multipart~) ce pose toujours.

* Gérer l'/encoding/ des e-mails (normaliser un /encoding/ vers de l'UTF-8) 

Camomile fait déjà le /mapping/ entre les /encodings/ et l'unicode. Cependant,
en regardant le code, c'est à la fois complexe, redondant et certainements
inutiles. Un simple exemple, la structure permettant de mapper un code d'un
encoding vers un autre est implémenter dans ~Tbl31~: le code est juste immonde -
un patricia tree suffirait largement (bien entendu, il faudrait faire des
benchmarks mais on y gagnerais en lisibilité).

Bon selon dbuenzli, Camomile supporterait que unicode 3 et dépends de fichiers
externes. Deux erreurs qu'il ne faudrait pas reproduire.

** Faire un outil d'importation des tables de mappings entre /charset/ et unicode
*** [ ] outil d'importation des tables ISO8859
*** [ ] outil d'importation des tables VENDORS

Il semble que ISO8859 partage le même format pour le /mapping/ (format A). Il
semnle aussi que les VENDORS, eux, ne partagent pas spécifiquement le même
format dans le /header/ et les valeurs n'ont pas forcément pas la même
représentation.

On peut faire un lexer/parser qui puisse accepter les différents formats.
Cependant, extraire les informations comme le nom, la date ou encore les auteurs
semble être plus difficile.

* TODO Ce forcer à utiliser org-mode (2 mois de tests)

