dinosaure.html

<div id="outline-container-orgd6b1cd0" class="outline-2">
<h2 id="orgd6b1cd0"><span class="section-number-2">11</span> <span class="done DONE">DONE</span> Vérifier RFC1951 sur les derniers bytes</h2>
<div class="outline-text-2" id="text-11">
<p>
En effet, puisque RFC1951 n'est pas forcément aligné, il nous faut vérifier
proprement si on a bien écrit les derniers bytes nécessaires qui devrait se
retrouver dans <code>hold</code> (et signaler à l'utilisateur combien de bits sont libres).
</p>
</div>
</div>

<div id="outline-container-orgc094b76" class="outline-2">
<h2 id="orgc094b76"><span class="section-number-2">12</span> Fuzzer encore</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org2861b87" class="outline-3">
<h3 id="org2861b87"><span class="section-number-3">12.1</span> Il faut attendre la <a href="https://github.com/stedolan/crowbar/pull/36">PR de Gabriel</a> pour faire ce travail.</h3>
</div>
</div>

<div id="outline-container-org05adb40" class="outline-2">
<h2 id="org05adb40"><span class="section-number-2">13</span> <span class="todo TODO">TODO</span> Optimiser ocaml-git</h2>
</div>
<div id="outline-container-orgea0e86c" class="outline-2">
<h2 id="orgea0e86c"><span class="section-number-2">14</span> <span class="todo TODO">TODO</span> Trouver pourquoi on avait pas trouver le bug par rapport aux \000 dans les noms dans les trees</h2>
</div>
<div id="outline-container-org0c42b4a" class="outline-2">
<h2 id="org0c42b4a"><span class="section-number-2">15</span> <span class="todo TODO">TODO</span> Faire le serveur</h2>
<div class="outline-text-2" id="text-15">
</div>
<div id="outline-container-org1ed12af" class="outline-3">
<h3 id="org1ed12af"><span class="section-number-3">15.1</span> [ ] Fuzzer l'encoder et le décoder Smart</h3>
</div>
<div id="outline-container-org9fd854e" class="outline-3">
<h3 id="org9fd854e"><span class="section-number-3">15.2</span> [ ] Faire le moteur de négociation</h3>
</div>
<div id="outline-container-orgc968942" class="outline-3">
<h3 id="orgc968942"><span class="section-number-3">15.3</span> [ ] Faire une abstraction du serveur (TCP pour l'instant)</h3>
</div>
</div>
<div id="outline-container-org4a6b323" class="outline-2">
<h2 id="org4a6b323"><span class="section-number-2">16</span> Implémenter un <i>call-by-need</i> dans ocaml-git</h2>
<div class="outline-text-2" id="text-16">
<p>
L'idée est de ne pas obtenir l'objet Git dès qu'on souhaite juste le manipuler
(<code>Value.t</code>) mais de l'obtenir seulement quand on souhaite accéder à une
information à l'intérieur (comme <code>Value.Commit.tree</code>).
</p>

<p>
On peut imaginer cette définition:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">type</span> <span class="org-keyword">lazy</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Pack</span> <span class="org-keyword">of</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">{</span></span> hash <span class="org-tuareg-font-lock-operator">:</span> <span class="org-tuareg-font-lock-module">Hash.</span>t<span class="org-tuareg-font-lock-operator">;</span> offset <span class="org-tuareg-font-lock-operator">:</span> int64 <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">}</span></span> <span class="org-comment-delimiter">(* </span><span class="org-comment">identifiant du PACK et son offset dans le dit-PACK </span><span class="org-comment-delimiter">*)</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Loose</span>
<span class="org-tuareg-font-lock-governing">and</span> <span class="org-variable-name">t</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Loaded</span> <span class="org-keyword">of</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">[</span></span> <span class="org-tuareg-font-lock-constructor">`Commit</span> <span class="org-keyword">of</span> <span class="org-tuareg-font-lock-module">Commit.</span>t <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-operator">...</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">]</span></span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Unloaded</span> <span class="org-keyword">of</span> <span class="org-keyword">lazy</span>
</pre>
</div>

<p>
Bon après, je sais pas (et je pense pas) que cela soit vraiment efficace. On est
déjà dans une politique <i>call-by-need</i> dans le sens où on charge les objets
seulement quand on les demande explicitement.
</p>

<p>
Ici, il s'agit d'affiner un peu plus le <i>call-by-need</i> et de faire les
opérations nécessaires seulement quand on souhaite non seulement obtenir l'objet
mais aussi obtenir les informations qu'il contient - maintenant est ce que ce
n'est pas déjà le cas ?
</p>

<p>
Le retour de Thomas: Il voudrait raffiner le parser en collectant les
informations non pas d'un block comme c'est le cas mais petit à petit. On
pourrait s'en sortir avec <code>Angstrom</code> en splittant le parser en plusieurs
morceaux et en modifiant l'interface <code>Commit.D</code> pour notifier dès qu'on a
décoder le <code>tree</code> (puisque c'est spécifiquement celui ci qui nous intéresse) et
garder l'état du parser pour le faire continuer si l'utilisateur demande plus
d'informations.
</p>

<p>
Il est vrai que dans le format du commit, le <code>tree</code> est la première information
et on a ensuite les parents - qui sont toutes les deux des informations
relatives au parcours du DAG. Donc on peut imaginer que cela puisse être
intéressant - on évite notamment de décompresser au meilleur des cas les autres
valeurs et le message.
</p>

<p>
Bref, il faudrait s'intéresser à la question mais elle serait spécifique en
réalité au <code>Commit</code>, répercuter le code sur les <code>Blob</code> n'a pas de sens par
exemple.
</p>
</div>
</div>

<div id="outline-container-orgc815e04" class="outline-2">
<h2 id="orgc815e04"><span class="section-number-2">17</span> <span class="todo TODO">TODO</span> Regarder mirage-lambda et y participer</h2>
</div>

<div id="outline-container-orgbcceb0c" class="outline-2">
<h2 id="orgbcceb0c"><span class="section-number-2">18</span> Passer Mr. MIME à Angstrom</h2>
<div class="outline-text-2" id="text-18">
<p>
J'ai eu une idée de GADT.
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span class="org-tuareg-font-lock-governing">type</span> <span class="org-type">'a field</span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Content_type</span> <span class="org-tuareg-font-lock-operator">:</span> content_type field
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">Msg_id</span> <span class="org-tuareg-font-lock-operator">:</span> msg_id field

<span class="org-tuareg-font-lock-governing">type</span> <span class="org-type">res</span> <span class="org-tuareg-font-lock-operator">=</span>
  <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">[</span></span> <span class="org-tuareg-font-lock-constructor">`Await</span> <span class="org-keyword">of</span> decoder
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">`Header</span> <span class="org-keyword">of</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">(</span></span>'v field<span class="org-tuareg-font-lock-operator">,</span> 'v<span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-2">)</span></span>
  <span class="org-tuareg-font-lock-operator">|</span> <span class="org-tuareg-font-lock-constructor">`End</span> <span class="org-tuareg-font-lock-operator"><span class="org-rainbow-delimiters-depth-1">]</span></span>
</pre>
</div>

<p>
En gros, le décodeur va s'arrêter à chaque <i>fields</i> de l'e-mail et donner sa
valeur. Ce sera super bien typé grâce au GADT <code>field</code>. Il suffira d'une fonction
<code>continue</code> pour passer au <code>field</code> suivant ou au <code>body</code>. Cependant, la question
du <code>body</code> (entre <code>multipart/alternate</code> ou simple <code>multipart</code>) ce pose toujours.
</p>
</div>
</div>

<div id="outline-container-org18fe732" class="outline-2">
<h2 id="org18fe732"><span class="section-number-2">19</span> Gérer l'<i>encoding</i> des e-mails (normaliser un <i>encoding</i> vers de l'UTF-8)</h2>
<div class="outline-text-2" id="text-19">
<p>
Camomile fait déjà le <i>mapping</i> entre les <i>encodings</i> et l'unicode. Cependant,
en regardant le code, c'est à la fois complexe, redondant et certainements
inutiles. Un simple exemple, la structure permettant de mapper un code d'un
encoding vers un autre est implémenter dans <code>Tbl31</code>: le code est juste immonde -
un patricia tree suffirait largement (bien entendu, il faudrait faire des
benchmarks mais on y gagnerais en lisibilité).
</p>

<p>
Bon selon dbuenzli, Camomile supporterait que unicode 3 et dépends de fichiers
externes. Deux erreurs qu'il ne faudrait pas reproduire.
</p>
</div>

<div id="outline-container-orgf6ce0e7" class="outline-3">
<h3 id="orgf6ce0e7"><span class="section-number-3">19.1</span> Faire un outil d'importation des tables de mappings entre <i>charset</i> et unicode</h3>
<div class="outline-text-3" id="text-19-1">
</div>
<div id="outline-container-org6f689c1" class="outline-4">
<h4 id="org6f689c1"><span class="section-number-4">19.1.1</span> [ ] outil d'importation des tables ISO8859</h4>
</div>
<div id="outline-container-org4c22878" class="outline-4">
<h4 id="org4c22878"><span class="section-number-4">19.1.2</span> [ ] outil d'importation des tables VENDORS</h4>
<div class="outline-text-4" id="text-19-1-2">
<p>
Il semble que ISO8859 partage le même format pour le <i>mapping</i> (format A). Il
semnle aussi que les VENDORS, eux, ne partagent pas spécifiquement le même
format dans le <i>header</i> et les valeurs n'ont pas forcément pas la même
représentation.
</p>

<p>
On peut faire un lexer/parser qui puisse accepter les différents formats.
Cependant, extraire les informations comme le nom, la date ou encore les auteurs
semble être plus difficile.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org8c1fe52" class="outline-2">
<h2 id="org8c1fe52"><span class="section-number-2">20</span> <span class="todo TODO">TODO</span> Ce forcer à utiliser org-mode (2 mois de tests)</h2>
</div>
