dinosaure.html

<div id="outline-container-org7c7f860" class="outline-2">
<h2 id="org7c7f860"><span class="section-number-2">21</span> <span class="todo TODO">TODO</span> Avoir deux serveur uDNS (un sur intel et un sur arm) et configurer son PC sur ces serveur</h2>
<div class="outline-text-2" id="text-21">
<p>
Ce qui est compliqué, c'est que les ressources pour utiliser udns sont
inexistante et il faut pousser hannes pour faire un tutoriel.
</p>
</div>
</div>

<div id="outline-container-org86ef9cc" class="outline-2">
<h2 id="org86ef9cc"><span class="section-number-2">22</span> Implémenter Lwt<sub>sequence</sub> avec CFML ou Why3 pour ocaml-tcpip</h2>
<div class="outline-text-2" id="text-22">
<p>
Lwt<sub>sequence</sub> va devenir obsolète, cela peut donc être une bonne opportunité de
passer à du code prouvé
</p>

<p>
Un papier de Filliâtre (de 2003, hal-00789533) infirme la possibilité de prover
une liste doublement chaînée avec Why3. Il faudrait donc se tourner vers CFML -
les ressources sont moins accessibles cependant.
</p>
</div>
</div>

<div id="outline-container-org18853c3" class="outline-2">
<h2 id="org18853c3"><span class="section-number-2">23</span> <span class="todo TODO">TODO</span> Exporter les parsers d'Emile</h2>
<div class="outline-text-2" id="text-23">
<p>
Dans mon implémentation des fichiers <i>database</i> des charset avec l'unicode, il
est nécessaire (pour éviter la duplication de code) que d'exporter les parsers
d'emile.
</p>
</div>
</div>

<div id="outline-container-org7150d49" class="outline-2">
<h2 id="org7150d49"><span class="section-number-2">24</span> <span class="todo TODO">TODO</span> Meilleur documentation pour Emile</h2>
</div>
<div id="outline-container-org0f39b85" class="outline-2">
<h2 id="org0f39b85"><span class="section-number-2">25</span> <span class="todo TODO">TODO</span> Faire une issue sur <a href="https://github.com/inhabitedtype/bigstringaf">bigstringaf</a> pour connaitre et déblayer la situation avec <code>Cstruct</code> spécifiquement</h2>
<div class="outline-text-2" id="text-25">
<p>
Bon c'est une issue un peu délicate où il s'agit de comprendre la situation de
chacun par rapport au problème initial qu'est le module <code>Bigarray</code>. En soit, la
vrai question est de savoir si <code>bigstringaf</code> devrait remplacer <code>Cstruct.t</code>,
avoir un support pour MirageOS, et porter les différentes besoins par rapport à
<code>Bigarray</code>. La liste est celle-ci:
</p>
</div>

<div id="outline-container-org68bb9db" class="outline-3">
<h3 id="org68bb9db"><span class="section-number-3">25.1</span> Implémentation C (utilisant <code>memcpy</code> et/ou <code>memmove</code>).</h3>
<div class="outline-text-3" id="text-25-1">
<p>
La situation est que <code>Bigarray</code> utilise <code>memmove</code>. <code>Cstruct</code> peut ne pas
correspondre puisque de <code>Bigarray</code> vers <code>Bigarray</code>, il utilise <code>memmove</code>
(<code>Decompress</code> requiert la sémantique de <code>memcpy</code>, qu'importe si c'est un
<code>Bigarray</code> ou une <code>String</code>).
</p>

<p>
<a href="https://github.com/yallop/ocaml-memcpy">ocaml-memcpy</a> par @yallop propose déjà cette implémentation dirigé par
<code>ocaml-ctypes</code> ce qui ne le rends pas forcément favorable au niveau des petites
librairies comme <code>Angstrom</code> et <code>Decompress</code>.
</p>

<p>
La question est pourtant difficile puisque une implémentation en C demande à ce
qu'elle fonctionne sur MirageOS et si nous pouvions éviter du code C, ce serait
pas mal (ce que fait <code>Decompress</code>). Même si cela reste du code trivial, le
diable se cache dans les détails.
</p>
</div>
</div>

<div id="outline-container-org1ed6dc2" class="outline-3">
<h3 id="org1ed6dc2"><span class="section-number-3">25.2</span> Implémentation en OCaml</h3>
<div class="outline-text-3" id="text-25-2">
<p>
C'est l'option prise par <code>Decompress</code>. Bien entendu, il y a un impact sur les
performances mais des différents benchmarks que j'ai fait, ce n'est pas le
premier problème concernant <code>Decompress</code> (qui concerne plus le calcul Adler-32).
</p>

<p>
Pour <code>Angstrom</code>, bien entendu (et il me semble qu'il y a un <i>benchmark</i>),
l'exécution devrait être plus rapide et dans le contexte majoritaire où
<code>Angstrom</code> se retrouvé à utiliser <code>blit</code> (et donc <code>memmove~/~memcpy</code>) était pour
passer d'un input (qui maintenant est contraint à être un <code>Bigarray</code>) vers une
<code>string</code>. Dans l'implémentation de <code>Cstruct</code>, dans ce cas précis, il est utilisé
<code>memcpy</code> avec du code C.
</p>

<p>
Cependant, la question à propos de MirageOS a déjà été réglé sur cette
librairie. La question est donc de savoir pourquoi il y a eu un changement
depuis <code>Cstruct</code> vers un <i>stuff</i> interne, puis, ensuite vers <code>bigstringaf</code>. Bien
entendu, ceci devrait être en rapport avec les performances.
</p>
</div>
</div>

<div id="outline-container-orga489ee1" class="outline-3">
<h3 id="orga489ee1"><span class="section-number-3">25.3</span> Bound-check</h3>
<div class="outline-text-3" id="text-25-3">
<p>
Une critique pourtant qui s'applique à <code>Cstruct</code> est le <i>bound-check</i>. De mon
point de vue, il est nécessaire même dans des contextes où on peut être sûr que
le <i>bound-check</i> ne soit pas nécessaire. Je préfère échouer que de corrompre
l'information.
</p>

<p>
Le coût du <i>bound-check</i> n'a jamais vraiment été démontré (aucune trace de
<i>benchmark</i> pour <code>Angstrom</code>). Cela vaut vraiment le coût ? Une question sans
réponse.
</p>
</div>
</div>

<div id="outline-container-org20c5d77" class="outline-3">
<h3 id="org20c5d77"><span class="section-number-3">25.4</span> Disgression</h3>
<div class="outline-text-3" id="text-25-4">
<p>
Il y a bien entendu la question avec <code>js_of_ocaml</code> et <code>bucklescript</code>. Mais
flemme, <code>Cstruct</code> à un support de <code>js_of_ocaml</code> mais pas de <code>bucklescript</code>. Le
reste des librairies n'en n'ont pas.
</p>
</div>
</div>

<div id="outline-container-org77c24e0" class="outline-3">
<h3 id="org77c24e0"><span class="section-number-3">25.5</span> Conclusion</h3>
<div class="outline-text-3" id="text-25-5">
<p>
Il ne s'agit pas d'être bêtement contre <code>bigstringaf</code> mais de faire un état des
lieux et de choisir le meilleur pour tout le monde. Je serais ravi qu'il n'y est
qu'une seule librairie qui fasse correctement le boulot. 
</p>

<p>
Cependant, la question ne peut pas être prise à la légère et si <code>bigstringaf</code>
devait remplir cette tâche, il lui incombe d'avoir non seulement un support pour
les différents cas (spécialement à propos de MirageOS).
</p>

<p>
Ce que je veux dire, c'est <code>bigstringaf</code> ne serait pas uniquement de la volonté
d'<code>Angstrom</code> et que cette dernière devrait s'occuper d'un plus large rôle (et
cela rajouterais des responsabilités). Bref, c'est surtout trouver une solution
qui puisse convenir et si choisir <code>bigstringaf</code> comme librairie de base pour des
plus gros projets (comme <code>ocaml-git</code>) est sans risque.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Calascibetta</p>
<p class="date">Created: 2018-04-16 lun. 04:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>